---
kind: method
id: M:Autodesk.Revit.UI.Events.IdlingEventArgs.SetRaiseWithoutDelay
source: html/6ead2453-9221-9044-0d93-84cc7db00b0d.htm
---
# Autodesk.Revit.UI.Events.IdlingEventArgs.SetRaiseWithoutDelay Method

Sets the next invocation of the idling event to be called promptly,
 rather than relying on the default recurrence of idling from the Revit application. For more
 details see the remarks describing the Idling event.

## Syntax (C#)
```csharp
public void SetRaiseWithoutDelay()
```